added ci with github workflows and benchmarks
